morse = {"a": "._","b": "_...","c": "_._.","d": "_..","e":".","f":".._.","h":"....","i":"..","j":".___","k":"_._",
"l":"._..","m":"__","n":"_.","o":"___","p":".__.","q":"__._","r":"._.","s":"...","t":"_","u":".._","v":"..._","w":".__",
"x":"_.._","y":"_.__","z":"__..",'а': '.-','б': '-...','в': '.--','г': '--.','д': '-..','е': '.','ё': '.','ж': '...-',
'з': '--..','и': '..','й': '.---','к': '-.-','л': '.-..','м': '--','н': '-.','о': '---','п': '.--.','р': '.-.','с': '...',
'т': '-','у': '..-','ф': '..-.','х': '....','ц': '-.-.','ч': '---.','ш': '----','щ': '--.-','ъ': '--.--','ы': '-.--',
'ь': '-..-','э': '..-..','ю': '..--','я': '.-.-',"1":".____","2":"..__..","3":"...__","4":"...._","5":".....",
"6":"_....","7":"__...","8":"___..","9":"____.","0":"_____"}


def encode(text: str):
        s = []
        for i in text:
            for m in morse.keys():
                if i.lower() == m:
                    s.append(morse[m])
        return " ".join(s)



def decode(text: str):
    s = []
    for i in text.split():
        for key, value in morse.items():
            if i == value:
                s.append(key)
    return ("".join(s)).capitalize()


def main():
    while True:
        print("1. зашифровать\n2. расшифровать\n3. выйти\nВыберите действие: ")
        n = int(input())
        match n:
            case 1:
                with open("morse.txt","w") as file:
                    file.write(encode(input("Введите текст:")))
            case 2:
                with open("morse.txt","w"):
                    file.write(decode(input("Введите текст: ")))
            case 3:
                print("Работа завершена")
                break
            case _:
                print("Такого действия нет")


if __name__ == "__main__":
    main()



