morse = {"a": "._","b": "_...","c": "_._.","d": "_..","e":".","f":".._.","h":"....","i":"..","j":".___","k":"_._",
"l":"._..","m":"__","n":"_.","o":"___","p":".__.","q":"__._","r":"._.","s":"...","t":"_","u":".._","v":"..._","w":".__",
"x":"_.._","y":"_.__","z":"__..",'а': '.-','б': '-...','в': '.--','г': '--.','д': '-..','е': '.','ё': '.','ж': '...-',
'з': '--..','и': '..','й': '.---','к': '-.-','л': '.-..','м': '--','н': '-.','о': '---','п': '.--.','р': '.-.','с': '...',
'т': '-','у': '..-','ф': '..-.','х': '....','ц': '-.-.','ч': '---.','ш': '----','щ': '--.-','ъ': '--.--','ы': '-.--',
'ь': '-..-','э': '..-..','ю': '..--','я': '.-.-',"1":".____","2":"..__..","3":"...__","4":"...._","5":".....",
"6":"_....","7":"__...","8":"___..","9":"____.","0":"_____"}


def encode(text: str):
        s = []
        for i in text:
            for m in morse.keys():
                if i.lower() == m:
                    s.append(morse[m])
        return " ".join(s)



def decode(text: str):
    s = []
    for i in text.split():
        for key, value in morse.items():
            if i == value:
                s.append(key)
    return ("".join(s)).capitalize()


def main():
        global b
        while True:
            print("Откуда взять текст?"
                  "1 - ввести вручную"
                  "2 - прочитать из файла")
            n = int(input(">>> "))
            match n:
                case 1:
                    b = input("")
                case 2:
                    with open(f"{input("")}.txt","r") as file:
                        g = file.read()
            print("куда вывести результат?"
                  "1 - в консоль"
                  "2 - сохранить в файл")
            a = int(input(">>> "))
            match a:
                case 1:
                    d = int(input())
                    if d == 1:
                        print(list(map(encode,b)))
                    if d == 2:
                        print(list(map(decode,b)))
if __name__ == "__main__":
    main()



